modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr826x.svd
<?xml version="1.0" ?>
<device schemaVersion="1.3">
  <name>TLSR826X</name>
  <version>0.1</version>
  <description>Auto-generated SVD for Telink TLSR826X</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>SECONDARY_I2C</name>
      <description>Auto-generated from section 'secondary i2c'</description>
      <baseAddress>0x800000</baseAddress>
      <registers>
        <register>
          <name>I2C_SET</name>
          <description>Auto-generated from i2c_set; aliases: I2C_SPEED</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>I2C_ID</name>
          <description>Auto-generated from i2c_id</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>I2C_STATUS</name>
          <description>Auto-generated from i2c_status</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_I2C_CMD_BUSY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_BUS_BUSY</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_NAK</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MODE</name>
          <description>Auto-generated from i2c_mode</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_I2C_ADDR_AUTO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_MODE_MASTER</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_MEM_MAP</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_ADR_DAT</name>
          <description>Auto-generated from i2c_adr_dat; aliases: I2C_ADR, I2C_DAT_CTRL</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>I2C_DO</name>
          <description>Auto-generated from i2c_do</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>I2C_DI_CTRL</name>
          <description>Auto-generated from i2c_di_ctrl; aliases: I2C_DI</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>I2C_CTRL</name>
          <description>Auto-generated from i2c_ctrl</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_I2C_CMD_ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_CMD_ADR</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_CMD_DO</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_CMD_DI</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_CMD_START</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_CMD_STOP</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_CMD_READ_ID</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_CMD_NAK</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SECONDARY_SPI</name>
      <description>Auto-generated from section 'secondary spi'</description>
      <baseAddress>0x800008</baseAddress>
      <registers>
        <register>
          <name>SPI_DATA</name>
          <description>Auto-generated from spi_data</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>SPI_CTRL</name>
          <description>Auto-generated from spi_ctrl</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_SPI_CS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SPI_MASTER_MODE_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SPI_DATA_OUT_DIS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SPI_RD</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SPI_ADDR_AUTO</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SPI_BUSY</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SP</name>
          <description>Auto-generated from spi_sp</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_MASTER_SPI_CLK</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>FLD_SPI_ENABLE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SPI_PAD_SEL</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_INV_CLK</name>
          <description>Auto-generated from spi_inv_clk</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
        </register>
