modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr826x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MASTER_SPI</name>
      <description>Auto-generated from section 'master spi'</description>
      <baseAddress>0x80000c</baseAddress>
      <registers>
        <register>
          <name>MASTER_SPI_DATA</name>
          <description>Auto-generated from master_spi_data</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>MASTER_SPI_CTRL</name>
          <description>Auto-generated from master_spi_ctrl</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_MASTER_SPI_CS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MASTER_SPI_SDO</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MASTER_SPI_CONT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MASTER_SPI_RD</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MASTER_SPI_BUSY</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OTP</name>
      <description>Auto-generated from section 'otp'</description>
      <baseAddress>0x800010</baseAddress>
      <registers>
        <register>
          <name>OTP_ADDR_PARA</name>
          <description>Auto-generated from otp_addr_para</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_OTP_PARA_ADDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>FLD_OTP_PARA_PTM</name>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_CTRL</name>
          <description>Auto-generated from otp_ctrl</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_OTP_CTRL_PCEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_OTP_FAST_CLK</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_OTP_OEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_OTP_CLK</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_OTP_PCEN_PWDN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_OTP_WEN_PWDN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_OTP_OEN_PWDN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_OTP_CLK_PWDN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_BYTE_DAT</name>
          <description>Auto-generated from otp_byte_dat</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>OTP_DAT</name>
          <description>Auto-generated from otp_dat</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>OTP_BLK_CODE</name>
          <description>Auto-generated from otp_blk_code</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>I2C_IRQ_STATUS</name>
          <description>Auto-generated from i2c_irq_status</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>I2C_CLR_STATUS</name>
          <description>Auto-generated from i2c_clr_status</description>
          <addressOffset>0x12</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_I2C_STATUS_WR</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2C_STATUS_RD</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>Auto-generated from section 'adc'</description>
      <baseAddress>0x800028</baseAddress>
      <registers>
        <register>
          <name>ADC_PGA_SEL_M</name>
          <description>Auto-generated from adc_pga_sel_m</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ADC_PGA_SEL_L</name>
          <description>Auto-generated from adc_pga_sel_l</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ADC_PGA_SEL_R</name>
          <description>Auto-generated from adc_pga_sel_r</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ADC_REF</name>
          <description>Auto-generated from adc_ref; aliases: ADC_REF</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_ADC_REF_M</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_REF_L</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_REF_R</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CHN_M_SEL</name>
          <description>Auto-generated from adc_chn_m_sel</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ADC_CHN_L_SEL</name>
          <description>Auto-generated from adc_chn_l_sel</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ADC_CHN_R_SEL</name>
          <description>Auto-generated from adc_chn_r_sel</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_ADC_CHN_SEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_DIFF_CHN_SEL</name>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_RES_LR</name>
          <description>Auto-generated from adc_res_lr</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ADC_PERIOD_CHN0</name>
          <description>Auto-generated from adc_period_chn0</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>ADC_PERIOD_CHN12</name>
          <description>Auto-generated from adc_period_chn12</description>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ADC_CTRL</name>
          <description>Auto-generated from adc_ctrl</description>
          <addressOffset>0xb</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_ADC_CHNL_AUTO_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_CHNR_AUTO_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_AUD_DATAPATH_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_CHNM_AUTO_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CHN1_OUTP</name>
          <description>Auto-generated from adc_chn1_outp</description>
          <addressOffset>0xc</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_ADC_OUTPUT_CHN_VAL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_CHN_MANU_START</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CHN2_OUTP</name>
          <description>Auto-generated from adc_chn2_outp</description>
          <addressOffset>0xe</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>ADC_DAT_BYP_OUTP</name>
          <description>Auto-generated from adc_dat_byp_outp</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>ADC_CHN0_INPUT</name>
          <description>Auto-generated from adc_chn0_input</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>ADC_RES_M</name>
          <description>Auto-generated from adc_res_m; aliases: ADC_SAMP_RES</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_ADC_CHNM_SAMP_CYCLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_CHNM_SAMP_RESOL</name>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_CHNLR_SAMP_CYCLE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_TSAMP_LR</name>
          <description>Auto-generated from adc_tsamp_lr</description>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
        </register>
