modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr826x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AUDIO</name>
      <description>Auto-generated from section 'audio'</description>
      <baseAddress>0x800056</baseAddress>
      <registers>
        <register>
          <name>AUD_CONST</name>
          <description>Auto-generated from aud_const</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>CTRL_EP_PTR</name>
          <description>Auto-generated from ctrl_ep_ptr</description>
          <addressOffset>0xaa</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>CTRL_EP_DAT</name>
          <description>Auto-generated from ctrl_ep_dat</description>
          <addressOffset>0xab</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>CTRL_EP_CTRL</name>
          <description>Auto-generated from ctrl_ep_ctrl</description>
          <addressOffset>0xac</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_EP_DAT_ACK</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_EP_DAT_STALL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_EP_STA_ACK</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_EP_STA_STALL</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_EP_IRQ_STA</name>
          <description>Auto-generated from ctrl_ep_irq_sta</description>
          <addressOffset>0xad</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_CTRL_EP_IRQ_TRANS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_IRQ_SETUP</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_IRQ_DATA</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_IRQ_STA</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_IRQ_INTF</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_EP_IRQ_MODE</name>
          <description>Auto-generated from ctrl_ep_irq_mode</description>
          <addressOffset>0xae</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_CTRL_EP_AUTO_ADDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_CFG</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_INTF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_STA</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_SYN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_DESC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_FEAT</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_STD</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CTRL</name>
          <description>Auto-generated from usb_ctrl</description>
          <addressOffset>0xaf</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_USB_CTRL_AUTO_CLK</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_CTRL_LOW_SPD</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_CTRL_LOW_JITT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_CTRL_TST_MODE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CYC_CALI</name>
          <description>Auto-generated from usb_cyc_cali</description>
          <addressOffset>0xb0</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>USB_MDEV</name>
          <description>Auto-generated from usb_mdev</description>
          <addressOffset>0xb4</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_HOST_CONN</name>
          <description>Auto-generated from usb_host_conn</description>
          <addressOffset>0xb5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_USB_MDEV_SELF_PWR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_MDEV_SUSP_STA</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_SUPS_CYC_CALI</name>
          <description>Auto-generated from usb_sups_cyc_cali</description>
          <addressOffset>0xb6</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_INTF_ALT</name>
          <description>Auto-generated from usb_intf_alt</description>
          <addressOffset>0xb7</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP8123_PTR</name>
          <description>Auto-generated from usb_ep8123_ptr; aliases: USB_EP8_PTR</description>
          <addressOffset>0xba</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP1_PTR</name>
          <description>Auto-generated from usb_ep1_ptr</description>
          <addressOffset>0xbb</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP2_PTR</name>
          <description>Auto-generated from usb_ep2_ptr</description>
          <addressOffset>0xbc</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP3_PTR</name>
          <description>Auto-generated from usb_ep3_ptr</description>
          <addressOffset>0xbd</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP4567_PTR</name>
          <description>Auto-generated from usb_ep4567_ptr; aliases: USB_EP4_PTR</description>
          <addressOffset>0xbe</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP5_PTR</name>
          <description>Auto-generated from usb_ep5_ptr</description>
          <addressOffset>0xbf</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP6_PTR</name>
          <description>Auto-generated from usb_ep6_ptr</description>
          <addressOffset>0xc0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP7_PTR</name>
          <description>Auto-generated from usb_ep7_ptr</description>
          <addressOffset>0xc1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP8123_DAT</name>
          <description>Auto-generated from usb_ep8123_dat; aliases: USB_EP8_DAT</description>
          <addressOffset>0xc2</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP1_DAT</name>
          <description>Auto-generated from usb_ep1_dat</description>
          <addressOffset>0xc3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP2_DAT</name>
          <description>Auto-generated from usb_ep2_dat</description>
          <addressOffset>0xc4</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP3_DAT</name>
          <description>Auto-generated from usb_ep3_dat</description>
          <addressOffset>0xc5</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP4567_DAT</name>
          <description>Auto-generated from usb_ep4567_dat; aliases: USB_EP4_DAT</description>
          <addressOffset>0xc6</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP5_DAT</name>
          <description>Auto-generated from usb_ep5_dat</description>
          <addressOffset>0xc7</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP6_DAT</name>
          <description>Auto-generated from usb_ep6_dat</description>
          <addressOffset>0xc8</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP7_DAT</name>
          <description>Auto-generated from usb_ep7_dat</description>
          <addressOffset>0xc9</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP8_CTRL</name>
          <description>Auto-generated from usb_ep8_ctrl</description>
          <addressOffset>0xca</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP1_CTRL</name>
          <description>Auto-generated from usb_ep1_ctrl</description>
          <addressOffset>0xcb</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP2_CTRL</name>
          <description>Auto-generated from usb_ep2_ctrl</description>
          <addressOffset>0xcc</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP3_CTRL</name>
          <description>Auto-generated from usb_ep3_ctrl</description>
          <addressOffset>0xcd</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP4_CTRL</name>
          <description>Auto-generated from usb_ep4_ctrl</description>
          <addressOffset>0xce</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP5_CTRL</name>
          <description>Auto-generated from usb_ep5_ctrl</description>
          <addressOffset>0xcf</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP6_CTRL</name>
          <description>Auto-generated from usb_ep6_ctrl</description>
          <addressOffset>0xd0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP7_CTRL</name>
          <description>Auto-generated from usb_ep7_ctrl</description>
          <addressOffset>0xd1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_USB_EP_BUSY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EP_STALL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EP_DAT0</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EP_DAT1</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EP_MONO</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EP_EOF_ISO</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_EP8123_BUF_ADDR</name>
          <description>Auto-generated from usb_ep8123_buf_addr; aliases: USB_EP8_BUF_ADDR</description>
          <addressOffset>0xd2</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP1_BUF_ADDR</name>
          <description>Auto-generated from usb_ep1_buf_addr</description>
          <addressOffset>0xd3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP2_BUF_ADDR</name>
          <description>Auto-generated from usb_ep2_buf_addr</description>
          <addressOffset>0xd4</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP3_BUF_ADDR</name>
          <description>Auto-generated from usb_ep3_buf_addr</description>
          <addressOffset>0xd5</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP4567_BUF_ADDR</name>
          <description>Auto-generated from usb_ep4567_buf_addr; aliases: USB_EP4_BUF_ADDR</description>
          <addressOffset>0xd6</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP5_BUF_ADDR</name>
          <description>Auto-generated from usb_ep5_buf_addr</description>
          <addressOffset>0xd7</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP6_BUF_ADDR</name>
          <description>Auto-generated from usb_ep6_buf_addr</description>
          <addressOffset>0xd8</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP7_BUF_ADDR</name>
          <description>Auto-generated from usb_ep7_buf_addr</description>
          <addressOffset>0xd9</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_RAM_CTRL</name>
          <description>Auto-generated from usb_ram_ctrl</description>
          <addressOffset>0xda</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_USB_CEN_PWR_DN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_CLK_PWR_DN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_WEN_PWR_DN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_CEN_FUNC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_ISO_MODE</name>
          <description>Auto-generated from usb_iso_mode</description>
          <addressOffset>0xe2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_IRQ</name>
          <description>Auto-generated from usb_irq</description>
          <addressOffset>0xe3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_MASK</name>
          <description>Auto-generated from usb_mask</description>
          <addressOffset>0xe4</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP8_SEND_MAX</name>
          <description>Auto-generated from usb_ep8_send_max</description>
          <addressOffset>0xe5</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP8_SEND_THRES</name>
          <description>Auto-generated from usb_ep8_send_thres</description>
          <addressOffset>0xe6</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP8_FIFO_MODE</name>
          <description>Auto-generated from usb_ep8_fifo_mode</description>
          <addressOffset>0xe7</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP_MAX_SIZE</name>
          <description>Auto-generated from usb_ep_max_size</description>
          <addressOffset>0xe8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_USB_ENP8_FIFO_MODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_ENP8_FULL_FLAG</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_TX_MODE1</name>
          <description>Auto-generated from rf_tx_mode1; aliases: RF_TX_MODE</description>
          <addressOffset>0x3aa</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_RF_TX_DMA_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_CRC_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_BANDWIDTH</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_OUTPUT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_TST_OUT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_TST_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_TST_MODE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_ZB_PN_EN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_ZB_FEC_EN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_ZB_INTL_EN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_1M2M_PN_EN</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_1M2M_FEC_EN</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_1M2M_INTL_EN</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_TX_BUF_STA</name>
          <description>Auto-generated from rf_tx_buf_sta</description>
          <addressOffset>0x3c6</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RF_RX_SENSE_THR</name>
          <description>Auto-generated from rf_rx_sense_thr</description>
          <addressOffset>0x3cc</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>RF_RX_AUTO</name>
          <description>Auto-generated from rf_rx_auto</description>
          <addressOffset>0x3d0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RF_RX_IRR_GAIN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_IRR_PHASE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_DAC_I</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_DAC_Q</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_LNA_GAIN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_MIX2_GAIN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_PGA_GAIN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_CAL_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RX_SYNC</name>
          <description>Auto-generated from rf_rx_sync</description>
          <addressOffset>0x3d1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RF_FREQ_COMP_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_ADC_SYNC</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_ADC_INP_SIGNED</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_SWAP_ADC_IQ</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_NOTCH_FREQ_SEL</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_NOTCH_BAND_SEL</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_NOTCH_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_DN_CONV_FREQ_SEL</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
