modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr826x.svd
        <register>
          <name>RF_RX_MODE</name>
          <description>Auto-generated from rf_rx_mode</description>
          <addressOffset>0x3d2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RF_RX_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_MODE_1M</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_MODE_2M</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_LOW_IF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_BYPASS_DCOC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_MAN_FINE_TUNE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_SINGLE_CAL</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_LOW_PASS_FILTER</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RX_PILOT</name>
          <description>Auto-generated from rf_rx_pilot</description>
          <addressOffset>0x3d5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RF_PILOT_LEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_RF_ZB_SFD_CHK</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_1M_SFD_CHK</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_2M_SFD_CHK</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_ZB_OR_AUTO</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RX_CHN_DC</name>
          <description>Auto-generated from rf_rx_chn_dc</description>
          <addressOffset>0x3d6</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RF_RX_Q_CHN_CAL</name>
          <description>Auto-generated from rf_rx_q_chn_cal</description>
          <addressOffset>0x3d9</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RF_RX_DCQ_HIGH</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_DCQ_CAL_START</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RX_PEL</name>
          <description>Auto-generated from rf_rx_pel; aliases: RF_RX_PEL_GAIN</description>
          <addressOffset>0x3de</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RF_RX_RSSI_OFFSET</name>
          <description>Auto-generated from rf_rx_rssi_offset</description>
          <addressOffset>0x3e3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>RF_RX_HDX</name>
          <description>Auto-generated from rf_rx_hdx</description>
          <addressOffset>0x3e5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RX_HEADER_LEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_RT_TICK_LO_SEL</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RT_TICK_HI_SEL</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RT_TICK_FRAME</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PKT_LEN_OUTP_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RX_GCTL</name>
          <description>Auto-generated from rf_rx_gctl</description>
          <addressOffset>0x3e6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RX_GCTL_CIC_SAT_LO_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RX_GCTL_CIC_SAT_HI_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RX_GCTL_AUTO_PWR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RX_GCTL_ADC_RST_VAL</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RX_GCTL_ADC_RST_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RX_GCTL_PWR_CHG_DET_S</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RX_GCTL_PWR_CHG_DET_N</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RX_PEAK</name>
          <description>Auto-generated from rf_rx_peak</description>
          <addressOffset>0x3e7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RX_PEAK_DET_SRC_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FLD_TX_PEAK_DET_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PEAK_DET_NUM</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_PEAK_MAX_CNT_PRD</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RX_STATUS</name>
          <description>Auto-generated from rf_rx_status</description>
          <addressOffset>0x3ed</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RF_RX_STATE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_STA_RSV</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_INTR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_TX_INTR</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_RND_MODE</name>
          <description>Auto-generated from rx_rnd_mode</description>
          <addressOffset>0x3f1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RX_RND_SRC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RX_RND_MANU_MODE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RX_RND_AUTO_RD</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RX_RND_FREE_MODE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RX_RND_CLK_DIV</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_NUMBER</name>
          <description>Auto-generated from rnd_number</description>
          <addressOffset>0x3f2</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>BB_MAX_TICK</name>
          <description>Auto-generated from bb_max_tick</description>
          <addressOffset>0x3f6</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>RF_RTT</name>
          <description>Auto-generated from rf_rtt</description>
          <addressOffset>0x3fe</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLD_RTT_CAL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FLD_RTT_CYC1</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FLD_RTT_LOCK</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FLD_RT_SD_DLY_40M</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_RT_SD_DLY_BYPASS</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CHN_RSSI</name>
          <description>Auto-generated from rf_chn_rssi</description>
          <addressOffset>0x402</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PLL_RX_COARSE_TUNE</name>
          <description>Auto-generated from pll_rx_coarse_tune</description>
          <addressOffset>0x47a</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>PLL_RX_COARSE_DIV</name>
          <description>Auto-generated from pll_rx_coarse_div</description>
          <addressOffset>0x47c</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PLL_RX_FINE_TUNE</name>
          <description>Auto-generated from pll_rx_fine_tune</description>
          <addressOffset>0x47e</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>PLL_RX_FINE_DIV</name>
          <description>Auto-generated from pll_rx_fine_div</description>
          <addressOffset>0x480</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PLL_TX_COARSE_TUNE</name>
          <description>Auto-generated from pll_tx_coarse_tune</description>
          <addressOffset>0x482</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>PLL_TX_COARSE_DIV</name>
          <description>Auto-generated from pll_tx_coarse_div</description>
          <addressOffset>0x484</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PLL_TX_FINE_TUNE</name>
          <description>Auto-generated from pll_tx_fine_tune</description>
          <addressOffset>0x486</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>PLL_TX_FINE_DIV</name>
          <description>Auto-generated from pll_tx_fine_div</description>
          <addressOffset>0x488</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PLL_RX_FRAC</name>
          <description>Auto-generated from pll_rx_frac</description>
          <addressOffset>0x48a</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>PLL_TX_FRAC</name>
          <description>Auto-generated from pll_tx_frac</description>
          <addressOffset>0x48e</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>PLL_TX_CTRL</name>
          <description>Auto-generated from pll_tx_ctrl; aliases: PLL_CTRL, PLL_CTRL16</description>
          <addressOffset>0x492</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLD_PLL_TX_CYC0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_TX_SOF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_TX_CYC1</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_TX_PRE_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_TX_VCO_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_TX_PWDN_DIV</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_TX_MOD_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_TX_MOD_TRAN_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX_CYC0</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX_SOF</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX_CYC1</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX_PRES_EN</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX_VCO_EN</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX_PWDN_DIV</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX_PEAK_EN</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX_TP_CYC</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_SD_RSTB</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_SD_INTG_EN</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_CP_TRI</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_PWDN_INTG1</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_PWDN_INTG2</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_PWDN_INTG_DIV</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_PEAK_DET_EN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_OPEN_LOOP_EN</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX_TICK_EN</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_TX_TICK_EN</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX_ALWAYS_ON</name>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_TX_ALWAYS_ON</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_MANUAL_MODE_EN</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_CAL_DONE_EN</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_LOCK_EN</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_RX_CTRL</name>
          <description>Auto-generated from pll_rx_ctrl</description>
          <addressOffset>0x493</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PLL_RX2_CYC0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX2_SOF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX2_CYC1</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX2_PRES_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX2_VCO_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX2_PD_DIV</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX2_PEAK_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_RX2_TP_CYC</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_CTRL_A</name>
          <description>Auto-generated from pll_ctrl_a</description>
          <addressOffset>0x495</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PLL_A_RX_TICK_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_A_TX_TICK_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_A_RX_ALWAYS_ON</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_A_TX_ALWAYS_ON</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_A_MANUAL_MODE_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_A_CAL_DONE_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_A_LOCK_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_POL_CTRL</name>
          <description>Auto-generated from pll_pol_ctrl</description>
          <addressOffset>0x496</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_PLL_POL_TX_PRE_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_TX_VCO_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_TX_PD_DIV</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_MOD_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_MOD_TRAN_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_RX_PRE_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_RX_VCO_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_RX_PD_DIV</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_SD_RSTB</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_SD_INTG_EN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_CP_TRI</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_TX_SOF</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_POL_RX_SOF</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
