modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr826x.svd
        <register>
          <name>RF_RX_CAP</name>
          <description>Auto-generated from rf_rx_cap; aliases: RF_TX_CAP</description>
          <addressOffset>0x49a</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>AUD_CTRL</name>
          <description>Auto-generated from aud_ctrl</description>
          <addressOffset>0x50a</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_SDM_PLAY_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_SHAPPING_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUD_VOL_CTRL</name>
          <description>Auto-generated from aud_vol_ctrl</description>
          <addressOffset>0x50b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AUD_PN1</name>
          <description>Auto-generated from aud_pn1</description>
          <addressOffset>0x50c</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AUD_PN2</name>
          <description>Auto-generated from aud_pn2</description>
          <addressOffset>0x50d</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ASCL_STEP</name>
          <description>Auto-generated from ascl_step</description>
          <addressOffset>0x50e</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>AUD_BASE_ADR</name>
          <description>Auto-generated from aud_base_adr</description>
          <addressOffset>0x512</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>AUD_BUFF_SIZE</name>
          <description>Auto-generated from aud_buff_size</description>
          <addressOffset>0x514</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AUD_RPTR</name>
          <description>Auto-generated from aud_rptr</description>
          <addressOffset>0x516</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>AUD_FILTER</name>
          <description>Auto-generated from aud_filter</description>
          <addressOffset>0xb2a</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_AUD_FLT_IBFT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_FLT_AUTO</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_FLT_FIFO0</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_FLT_FIFO1</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_FLT_BYPASS0</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_FLT_BYPASS1</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUD_SRAM</name>
          <description>Auto-generated from aud_sram</description>
          <addressOffset>0xb2b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>RF_IRQ_MASK</name>
          <description>Auto-generated from rf_irq_mask</description>
          <addressOffset>0xec6</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>RF_IRQ_STATUS</name>
          <description>Auto-generated from rf_irq_status</description>
          <addressOffset>0xeca</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_RF_IRQ_RX</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_TX</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_RX_TIMEOUT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_CRC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_CMD_DONE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_FSM_TIMEOUT</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_RETRY_HIT</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_FIRST_TIMEOUT</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYS</name>
      <description>Auto-generated from section 'sys'</description>
      <baseAddress>0x800060</baseAddress>
      <registers>
        <register>
          <name>RST0</name>
          <description>Auto-generated from rst0; aliases: RST0_16, RST_CLK0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLD_RST_SPI</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_I2C</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_USB</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_USB_PHY</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_MCU</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_MAC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_AIF</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_BB</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_ZB</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_GPIO</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_ALGM</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_DMA</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_UART</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_PWM</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_AES</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_SWR_M</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_SWR_S</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_SBC</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_AUD</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_DFIFO</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_ADC</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_SOFT_MCU</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_MCIC</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_SOFT_MCIC</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST_RSV</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_SPI_EN</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_I2C_EN</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_USB_EN</name>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_USB_PHY_EN</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_MCU_EN</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_MAC_EN</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_ADC_EN</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_ZB_EN</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RST1</name>
          <description>Auto-generated from rst1</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>RST2</name>
          <description>Auto-generated from rst2</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>CLK_EN</name>
          <description>Auto-generated from clk_en; aliases: CLK_EN1</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_CLK_GPIO_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_ALGM_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_DMA_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_UART_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_PWM_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_AES_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_32K_TIMER_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_SWIRE_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_32K_QDEC_EN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_AUD_EN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_DIFIO_EN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_KEYSCAN_EN</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_MCIC_EN</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_QDEC_EN</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_EN2</name>
          <description>Auto-generated from clk_en2</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_CLK2_SBC_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK2_AUD_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK2_DIFIO_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK2_I2S</name>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_CLK2_C32K</name>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_SEL</name>
          <description>Auto-generated from clk_sel</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_CLK_SEL_DIV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_SEL_SRC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_STEP</name>
          <description>Auto-generated from i2s_step</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_I2S_STEP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_CLK_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_MOD</name>
          <description>Auto-generated from i2s_mod</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ADC_STEP_L</name>
          <description>Auto-generated from adc_step_l</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ADC_MOD_L</name>
          <description>Auto-generated from adc_mod_l; aliases: ADC_MOD</description>
          <addressOffset>0xa</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_ADC_MOD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_STEP_H</name>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_CLK_EN</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CLK_EN</name>
          <description>Auto-generated from adc_clk_en; aliases: ADC_MOD_H</description>
          <addressOffset>0xb</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_ADC_MOD_H</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_MOD_H_STEP</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FLD_ADC_MOD_H_CLK</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMIC_STEP</name>
          <description>Auto-generated from dmic_step</description>
          <addressOffset>0xc</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_DMIC_STEP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>FLD_DMIC_CLK_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMIC_MOD</name>
          <description>Auto-generated from dmic_mod</description>
          <addressOffset>0xd</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>WAKEUP_EN</name>
          <description>Auto-generated from wakeup_en</description>
          <addressOffset>0xe</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_WAKEUP_SRC_I2C</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_SPI</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_USB</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_GPIO</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_I2C_SYN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_GPIO_RM</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_USB_RESM</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_RST_SYS</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWDN_CTRL</name>
          <description>Auto-generated from pwdn_ctrl</description>
          <addressOffset>0xf</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PWDN_CTRL_REBOOT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PWDN_CTRL_SLEEP</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FHS_SEL</name>
          <description>Auto-generated from fhs_sel</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_FHS_SELECT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDC_CLK</name>
          <description>Auto-generated from dcdc_clk</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
        </register>
