modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr826x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DEV_ID</name>
      <description>Auto-generated from section 'dev_id'</description>
      <baseAddress>0x800074</baseAddress>
      <registers>
        <register>
          <name>ID_WR_EN</name>
          <description>Auto-generated from id_wr_en</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>MCU_WAKEUP_MASK</name>
          <description>Auto-generated from mcu_wakeup_mask</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>PRODUCT_ID</name>
          <description>Auto-generated from product_id; aliases: FUNC_ID</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLD_ID_USB_SYS_CLOCK</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ID_MAC_CLOCK</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ID_SBC_CLOCK</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ID_RISC32_ENABLE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ID_I2S_ENABLE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ID_SDM_ENABLE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ID_RF_ENABLE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ID_ZB_ENABLE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VER_ID</name>
          <description>Auto-generated from ver_id</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PROD_ID</name>
          <description>Auto-generated from prod_id</description>
          <addressOffset>0xa</addressOffset>
          <size>16</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MAC</name>
      <description>Auto-generated from section 'mac'</description>
      <baseAddress>0x800080</baseAddress>
      <registers>
        <register>
          <name>MAC_CTRL</name>
          <description>Auto-generated from mac_ctrl</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_MAC_CTRL_TX_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MAC_CTRL_RX_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MAC_CTRL_SPD_100M</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MAC_CTRL_PHY_RST</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_IRQ_STA</name>
          <description>Auto-generated from mac_irq_sta</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_MAC_STA_TX_DONE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MAC_STA_RX_DONE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MAC_STA_TX_ERR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MAC_STA_RX_ERR</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MAC_STA_RX_CRC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MII_TX_DATA</name>
          <description>Auto-generated from mii_tx_data</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>MII_RX_DATA</name>
          <description>Auto-generated from mii_rx_data</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>MII_CLK</name>
          <description>Auto-generated from mii_clk</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_MII_PHY_ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>FLD_MII_CLK_DIV</name>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MII_CTRL</name>
          <description>Auto-generated from mii_ctrl</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_MII_INTERNAL_REG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>FLD_MII_BUSY</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MII_WR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MII_PREAM_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CLK_DIV</name>
          <description>Auto-generated from uart_clk_div</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_UART_CLK_DIV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CLK_DIV_EN</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CTRL0</name>
          <description>Auto-generated from uart_ctrl0</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_UART_BPWC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_UART_RX_DMA_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_TX_DMA_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_RX_IRQ_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_TX_IRQ_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTS_I_SELECT</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTS_EN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_PARITY_EN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CTRL1</name>
          <description>Auto-generated from uart_ctrl1</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>UART_RX_TIMEOUT</name>
          <description>Auto-generated from uart_rx_timeout</description>
          <addressOffset>0x1a</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_UART_TIMEOUT_BW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FLD_UART_TIMEOUT_MUL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
