modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr826x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SWIRE</name>
      <description>Auto-generated from section 'swire'</description>
      <baseAddress>0x8000b0</baseAddress>
      <registers>
        <register>
          <name>SWIRE_DATA</name>
          <description>Auto-generated from swire_data</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>SWIRE_CTRL1</name>
          <description>Auto-generated from swire_ctrl1</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_SWIRE_WR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SWIRE_RD</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SWIRE_CMD</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SWIRE_USB_DET</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SWIRE_USB_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIRE_CLK_DIV</name>
          <description>Auto-generated from swire_clk_div</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ANA_ADDR</name>
          <description>Auto-generated from ana_addr</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ANA_DATA</name>
          <description>Auto-generated from ana_data</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ANA_CTRL</name>
          <description>Auto-generated from ana_ctrl</description>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_ANA_BUSY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ANA_RSV</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ANA_RW</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ANA_START</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ANA_CYC</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA_MAC</name>
      <description>Auto-generated from section 'dma mac'</description>
      <baseAddress>0x800500</baseAddress>
      <registers>
        <register>
          <name>DMA0_ADDR</name>
          <description>Auto-generated from dma0_addr</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA0_CTRL</name>
          <description>Auto-generated from dma0_ctrl</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA1_ADDR</name>
          <description>Auto-generated from dma1_addr</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA1_CTRL</name>
          <description>Auto-generated from dma1_ctrl</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA2_ADDR</name>
          <description>Auto-generated from dma2_addr</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA2_CTRL</name>
          <description>Auto-generated from dma2_ctrl</description>
          <addressOffset>0xa</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA3_ADDR</name>
          <description>Auto-generated from dma3_addr</description>
          <addressOffset>0xc</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA3_CTRL</name>
          <description>Auto-generated from dma3_ctrl</description>
          <addressOffset>0xe</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA4_ADDR</name>
          <description>Auto-generated from dma4_addr</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA4_CTRL</name>
          <description>Auto-generated from dma4_ctrl</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA5_ADDR</name>
          <description>Auto-generated from dma5_addr</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA5_CTRL</name>
          <description>Auto-generated from dma5_ctrl</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA_CHN_EN</name>
          <description>Auto-generated from dma_chn_en</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_CHN_IRQ_MSK</name>
          <description>Auto-generated from dma_chn_irq_msk</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_TX_RDY0</name>
          <description>Auto-generated from dma_tx_rdy0</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_TX_RDY1</name>
          <description>Auto-generated from dma_tx_rdy1</description>
          <addressOffset>0x25</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_RX_RDY0</name>
          <description>Auto-generated from dma_rx_rdy0</description>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_RX_RDY1</name>
          <description>Auto-generated from dma_rx_rdy1</description>
          <addressOffset>0x27</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_DMA_CHN_UART_RX</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_UART_RX</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN_UART_TX</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_UART_TX</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN_RF_RX</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_RF_RX</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN_RF_TX</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_RF_TX</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RX_RPTR</name>
          <description>Auto-generated from dma_rx_rptr</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_RX_WPTR</name>
          <description>Auto-generated from dma_rx_wptr</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_TX_RPTR</name>
          <description>Auto-generated from dma_tx_rptr</description>
          <addressOffset>0x2a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_TX_WPTR</name>
          <description>Auto-generated from dma_tx_wptr</description>
          <addressOffset>0x2b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_TX_FIFO</name>
          <description>Auto-generated from dma_tx_fifo</description>
          <addressOffset>0x2c</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_DMA_BUF_SIZE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_RPTR_CLR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_RPTR_NEXT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_RPTR_SET</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_WR_MEM</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_PINGPONG_EN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_FIFO_EN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_AUTO_MODE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_BYTE_MODE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_CTRL</name>
          <description>Auto-generated from aes_ctrl</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_DATA</name>
          <description>Auto-generated from aes_data</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>AES_KEY0</name>
          <description>Auto-generated from aes_key0</description>
          <addressOffset>0x50</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY1</name>
          <description>Auto-generated from aes_key1</description>
          <addressOffset>0x51</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY2</name>
          <description>Auto-generated from aes_key2</description>
          <addressOffset>0x52</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY3</name>
          <description>Auto-generated from aes_key3</description>
          <addressOffset>0x53</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY4</name>
          <description>Auto-generated from aes_key4</description>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY5</name>
          <description>Auto-generated from aes_key5</description>
          <addressOffset>0x55</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY6</name>
          <description>Auto-generated from aes_key6</description>
          <addressOffset>0x56</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY7</name>
          <description>Auto-generated from aes_key7</description>
          <addressOffset>0x57</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY8</name>
          <description>Auto-generated from aes_key8</description>
          <addressOffset>0x58</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY9</name>
          <description>Auto-generated from aes_key9</description>
          <addressOffset>0x59</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY10</name>
          <description>Auto-generated from aes_key10</description>
          <addressOffset>0x5a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY11</name>
          <description>Auto-generated from aes_key11</description>
          <addressOffset>0x5b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY12</name>
          <description>Auto-generated from aes_key12</description>
          <addressOffset>0x5c</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY13</name>
          <description>Auto-generated from aes_key13</description>
          <addressOffset>0x5d</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY14</name>
          <description>Auto-generated from aes_key14</description>
          <addressOffset>0x5e</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AES_KEY15</name>
          <description>Auto-generated from aes_key15</description>
          <addressOffset>0x5f</addressOffset>
          <size>8</size>
        </register>
