modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr826x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO</name>
      <description>Auto-generated from section 'gpio'</description>
      <baseAddress>0x800580</baseAddress>
      <registers>
        <register>
          <name>GPIO_PA_IN</name>
          <description>Auto-generated from gpio_pa_in; aliases: GPIO_PA_SETTING1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PA_IE</name>
          <description>Auto-generated from gpio_pa_ie</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PA_OEN</name>
          <description>Auto-generated from gpio_pa_oen</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PA_OUT</name>
          <description>Auto-generated from gpio_pa_out</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PA_POL</name>
          <description>Auto-generated from gpio_pa_pol; aliases: GPIO_PA_SETTING2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PA_DS</name>
          <description>Auto-generated from gpio_pa_ds</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PA_GPIO</name>
          <description>Auto-generated from gpio_pa_gpio</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PA_IRQ_EN</name>
          <description>Auto-generated from gpio_pa_irq_en</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_IN</name>
          <description>Auto-generated from gpio_pb_in; aliases: GPIO_PB_SETTING1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PB_IE</name>
          <description>Auto-generated from gpio_pb_ie</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_OEN</name>
          <description>Auto-generated from gpio_pb_oen</description>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_OUT</name>
          <description>Auto-generated from gpio_pb_out</description>
          <addressOffset>0xb</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_POL</name>
          <description>Auto-generated from gpio_pb_pol; aliases: GPIO_PB_SETTING2</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PB_DS</name>
          <description>Auto-generated from gpio_pb_ds</description>
          <addressOffset>0xd</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_GPIO</name>
          <description>Auto-generated from gpio_pb_gpio</description>
          <addressOffset>0xe</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_IRQ_EN</name>
          <description>Auto-generated from gpio_pb_irq_en</description>
          <addressOffset>0xf</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_IN</name>
          <description>Auto-generated from gpio_pc_in; aliases: GPIO_PC_SETTING1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PC_IE</name>
          <description>Auto-generated from gpio_pc_ie</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_OEN</name>
          <description>Auto-generated from gpio_pc_oen</description>
          <addressOffset>0x12</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_OUT</name>
          <description>Auto-generated from gpio_pc_out</description>
          <addressOffset>0x13</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_POL</name>
          <description>Auto-generated from gpio_pc_pol; aliases: GPIO_PC_SETTING2</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PC_DS</name>
          <description>Auto-generated from gpio_pc_ds</description>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_GPIO</name>
          <description>Auto-generated from gpio_pc_gpio</description>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_IRQ_EN</name>
          <description>Auto-generated from gpio_pc_irq_en</description>
          <addressOffset>0x17</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_IN</name>
          <description>Auto-generated from gpio_pd_in; aliases: GPIO_PD_SETTING1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PD_IE</name>
          <description>Auto-generated from gpio_pd_ie</description>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_OEN</name>
          <description>Auto-generated from gpio_pd_oen</description>
          <addressOffset>0x1a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_OUT</name>
          <description>Auto-generated from gpio_pd_out</description>
          <addressOffset>0x1b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_POL</name>
          <description>Auto-generated from gpio_pd_pol; aliases: GPIO_PD_SETTING2</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PD_DS</name>
          <description>Auto-generated from gpio_pd_ds</description>
          <addressOffset>0x1d</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_GPIO</name>
          <description>Auto-generated from gpio_pd_gpio</description>
          <addressOffset>0x1e</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_IRQ_EN</name>
          <description>Auto-generated from gpio_pd_irq_en</description>
          <addressOffset>0x1f</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_IN</name>
          <description>Auto-generated from gpio_pe_in; aliases: GPIO_PE_SETTING1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PE_IE</name>
          <description>Auto-generated from gpio_pe_ie</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_OEN</name>
          <description>Auto-generated from gpio_pe_oen</description>
          <addressOffset>0x22</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_OUT</name>
          <description>Auto-generated from gpio_pe_out</description>
          <addressOffset>0x23</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_POL</name>
          <description>Auto-generated from gpio_pe_pol; aliases: GPIO_CTRL, GPIO_PE_SETTING2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_WAKEUP_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIO_IRQ_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S_SLAVE_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMII_REFCLK_OUTPUT_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PE_DS</name>
          <description>Auto-generated from gpio_pe_ds</description>
          <addressOffset>0x25</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_GPIO</name>
          <description>Auto-generated from gpio_pe_gpio</description>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_IRQ_EN</name>
          <description>Auto-generated from gpio_pe_irq_en</description>
          <addressOffset>0x27</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PF_IN</name>
          <description>Auto-generated from gpio_pf_in; aliases: GPIO_PF_SETTING1</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PF_IE</name>
          <description>Auto-generated from gpio_pf_ie</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PF_OEN</name>
          <description>Auto-generated from gpio_pf_oen</description>
          <addressOffset>0x2a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PF_OUT</name>
          <description>Auto-generated from gpio_pf_out</description>
          <addressOffset>0x2b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PF_POL</name>
          <description>Auto-generated from gpio_pf_pol; aliases: GPIO_PF_SETTING2</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PF_DS</name>
          <description>Auto-generated from gpio_pf_ds</description>
          <addressOffset>0x2d</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PF_GPIO</name>
          <description>Auto-generated from gpio_pf_gpio</description>
          <addressOffset>0x2e</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PF_IRQ_EN</name>
          <description>Auto-generated from gpio_pf_irq_en</description>
          <addressOffset>0x2f</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_CONFIG_FUNC</name>
          <description>Auto-generated from gpio_config_func; aliases: GPIO_CONFIG_FUNC0</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLD_I2S_REFCLK_DMIC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_BCK_BB_PEAK</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_BCK_PWM1</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_LCK_UART_RX</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_LCK_PWM2</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_DO_UART_TX</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_DO_PWM3</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_DI_DMIC</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_CONFIG_FUNC1</name>
          <description>Auto-generated from gpio_config_func1</description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RP_TX_CYC1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RN_BB_RSSI</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_GP6_BB_SS2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_GP7_RXADC_CLK</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RP_T0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RN_T1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_GP6_T_E</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_GP7_MDC</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_CONFIG_FUNC2</name>
          <description>Auto-generated from gpio_config_func2</description>
          <addressOffset>0x32</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_GP8_RXADC_DAT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_GP9_BB_SS1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_GP10_BBSS0</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SWS_BB_GAIN4</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMIC_CK_BBCLK_BB</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMIC_CK_REFCLK</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_TX</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_RX</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_CONFIG_FUNC3</name>
          <description>Auto-generated from gpio_config_func3</description>
          <addressOffset>0x33</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_CN_BB_GAIN3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CK_BB_GAIN2</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DO_BB_GAIN1</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DI_BB_GAIN0</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_DO_RXDV</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_DI_RXER</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_DI_TXSD</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_CONFIG_FUNC4</name>
          <description>Auto-generated from gpio_config_func4</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_DMIC_CK_RX_CLK</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_DI_RX_DAT</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_WAKEUP_IRQ</name>
          <description>Auto-generated from gpio_wakeup_irq</description>
          <addressOffset>0x35</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_GPIO_WAKEUP_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_GPIO_INTERRUPT_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
