modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr826x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMER</name>
      <description>Auto-generated from section 'timer'</description>
      <baseAddress>0x800620</baseAddress>
      <registers>
        <register>
          <name>TMR_CTRL</name>
          <description>Auto-generated from tmr_ctrl; aliases: TMR_CTRL16, TMR_CTRL8</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLD_TMR0_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_TMR0_MODE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_TMR1_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_TMR1_MODE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_TMR2_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_TMR2_MODE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_TMR_WD_CAPT</name>
              <bitOffset>9</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>FLD_TMR_WD_EN</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_TMR0_STA</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_TMR1_STA</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_TMR2_STA</name>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLR_WD</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR_STA</name>
          <description>Auto-generated from tmr_sta</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_TMR_STA_TMR0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_TMR_STA_TMR1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_TMR_STA_TMR2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_TMR_STA_WD</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR0_CAPT</name>
          <description>Auto-generated from tmr0_capt</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>TMR1_CAPT</name>
          <description>Auto-generated from tmr1_capt</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>TMR2_CAPT</name>
          <description>Auto-generated from tmr2_capt</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>TMR0_TICK</name>
          <description>Auto-generated from tmr0_tick</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>TMR1_TICK</name>
          <description>Auto-generated from tmr1_tick</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>TMR2_TICK</name>
          <description>Auto-generated from tmr2_tick</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>INTERRUPT</name>
      <description>Auto-generated from section 'interrupt'</description>
      <baseAddress>0x800640</baseAddress>
      <registers>
        <register>
          <name>IRQ_MASK</name>
          <description>Auto-generated from irq_mask</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>IRQ_EN</name>
          <description>Auto-generated from irq_en</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>IRQ_PRI</name>
          <description>Auto-generated from irq_pri</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>IRQ_SRC</name>
          <description>Auto-generated from irq_src</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>IRQ_SRC3</name>
          <description>Auto-generated from irq_src3</description>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_IRQ_TMR0_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_TMR1_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_TMR2_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_USB_PWDN_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_DMA_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_DAM_FIFO_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_UART_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_HOST_CMD_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_EP0_SETUP_EN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_EP0_DAT_EN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_EP0_STA_EN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_SET_INTF_EN</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_EP_DATA_EN</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_IRQ4_EN</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_ZB_RT_EN</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_SW_EN</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_AN_EN</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_USB_250US_EN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_USB_RST_EN</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_GPIO_EN</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_PM_EN</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_SYSTEM_TIMER</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_GPIO_RISC0_EN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_GPIO_RISC1_EN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_GPIO_RISC2_EN</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_EN</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEM_TICK</name>
          <description>Auto-generated from system_tick</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SYSTEM_TICK_IRQ</name>
          <description>Auto-generated from system_tick_irq</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SYSTEM_WAKEUP_TICK</name>
          <description>Auto-generated from system_wakeup_tick</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SYSTEM_TICK_MODE</name>
          <description>Auto-generated from system_tick_mode</description>
          <addressOffset>0x10c</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>SYSTEM_TICK_CTRL</name>
          <description>Auto-generated from system_tick_ctrl</description>
          <addressOffset>0x10f</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_SYSTEM_TICK_START</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SYSTEM_TICK_IRQ_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SYSTEM_TICK_RUNNING</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SYSTEM_TICK_STOP</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
