modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr826x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWM</name>
      <description>Auto-generated from section 'PWM'</description>
      <baseAddress>0x800780</baseAddress>
      <registers>
        <register>
          <name>PWM_ENABLE</name>
          <description>Auto-generated from pwm_enable</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_CLK</name>
          <description>Auto-generated from pwm_clk</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_MODE</name>
          <description>Auto-generated from pwm_mode</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_INVERT</name>
          <description>Auto-generated from pwm_invert</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_N_INVERT</name>
          <description>Auto-generated from pwm_n_invert</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_POL</name>
          <description>Auto-generated from pwm_pol</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PWM_CMP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>FLD_PWM_MAX</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_IRQ_MASK</name>
          <description>Auto-generated from pwm_irq_mask</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_IRQ_STA</name>
          <description>Auto-generated from pwm_irq_sta</description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>FIFO0_DATA</name>
          <description>Auto-generated from fifo0_data</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>PWM_PNUM0</name>
          <description>Auto-generated from pwm_pnum0</description>
          <addressOffset>0x8c</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>PWM_PNUM1</name>
          <description>Auto-generated from pwm_pnum1</description>
          <addressOffset>0x8e</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>FIFO1_DATA</name>
          <description>Auto-generated from fifo1_data</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FIFO2_DATA</name>
          <description>Auto-generated from fifo2_data</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DFIFO</name>
      <description>Auto-generated from section 'dfifo'</description>
      <baseAddress>0x800b00</baseAddress>
      <registers>
        <register>
          <name>DFIFO0_BUF</name>
          <description>Auto-generated from dfifo0_buf; aliases: DFIFO0_ADDR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DFIFO0_SIZE</name>
          <description>Auto-generated from dfifo0_size</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DFIFO_ANA_IN</name>
          <description>Auto-generated from dfifo_ana_in</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_DFIFO_MIC0_RISING_EDGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DFIFO_MIC_ADC_IN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DFIFO_AUD_INPUT_MONO</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIFO1_BUF</name>
          <description>Auto-generated from dfifo1_buf; aliases: DFIFO_SCALE</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLD_DFIFO2_DEC_CIC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_DFIFO0_DEC_SCALE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUD_HPF_ALC</name>
          <description>Auto-generated from aud_hpf_alc</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_IN_HPF_SFT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_IN_HPF_BYPASS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_IN_ALC_BYPASS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUD_ALC_VOL</name>
          <description>Auto-generated from aud_alc_vol</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DFIFO2_BUF</name>
          <description>Auto-generated from dfifo2_buf</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLD_DFIFO_BUF_ADDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>FLD_DFIFO_BUF_SIZE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
